Revit 2027 API
BuiltInFailures.RebarFailures.NoVisibleRebarHandle Property
 Editing of the constraints for the selected rebar with free form geometry is not available. However, the default automatic constraints may still work.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoVisibleRebarHandle { get; }
Public Shared ReadOnly Property NoVisibleRebarHandle As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoVisibleRebarHandle {
	FailureDefinitionId^ get ();
}
static member NoVisibleRebarHandle : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace